Управляемые формы 1С 8.3/Documents/Покупка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Покупка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.Продукты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Управляемые формы 1С 8.3/AccumulationRegisters/Продукты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продукты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Управляемые формы 1С 8.3/AccumulationRegisters/Затраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Затраты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Управляемые формы 1С 8.3/Documents/Покупка/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Первый вариант
	СуммаДокумента = 0;
	
	Для Каждого СтрокаДокумента Из Продукты Цикл
		СуммаДокумента = СуммаДокумента + (СтрокаДокумента.Количество * СтрокаДокумента.Цена);
	КонецЦикла;	
	
	//Второй вариант. Он бы работал, если бы была колонка Сумма
	//СуммаДокумента = Продукты.Итог("Сумма")
	
	//Третий вариант, через запрос. тоже неудачный.
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СУММА(ПокупкаПродукты.Количество * ПокупкаПродукты.Цена) КАК Сумма
	//               |ИЗ
	//               |	Документ.Покупка.Продукты КАК ПокупкаПродукты
	//               |ГДЕ
	//               |	ПокупкаПродукты.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	СуммаДокумента = ВыборкаДетальныеЗаписи.Сумма;
	//КонецЕсли;
	                                                  	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
		
	//Проверим, нужно ли проводить документ
	Если Продукты.Количество() = 0 Тогда
		Сообщить("Внимание! Документ не содержит строк! Проведение невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Установим флаг сохранения движений по регистру Продукты и Затраты
	Движения.Продукты.Записывать = Истина;
	Движения.Затраты.Записывать  = Истина;
	
	//Выбираем данные из документа
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПокупкаПродукты.Продукт КАК Продукт,
	               |	СУММА(ПокупкаПродукты.Количество) КАК Количество,
	               |	СУММА(ПокупкаПродукты.Количество * ПокупкаПродукты.Цена) КАК Сумма
	               |ИЗ
	               |	Документ.Покупка.Продукты КАК ПокупкаПродукты
	               |ГДЕ
	               |	ПокупкаПродукты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПокупкаПродукты.Продукт";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Формируем движения/записи регистра
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.Продукты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период 	 = Дата;
		Движение.Продукт 	 = ВыборкаДетальныеЗаписи.Продукт;
		Движение.Количество  = ВыборкаДетальныеЗаписи.Количество;	
		Движение.Сумма		 = ВыборкаДетальныеЗаписи.Сумма;
	
	КонецЦикла;
	
	//Запишем сумму в затраты
	ДвижениеЗатрат = Движения.Затраты.Добавить();
	ДвижениеЗатрат.Период 	= Дата;
	ДвижениеЗатрат.Магазин 	= Магазин;
	ДвижениеЗатрат.Сумма    = СуммаДокумента;	
	
КонецПроцедуры
